{"format": "graph-model", "generatedBy": "2.20.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input_layer": {"name": "input_layer:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "8"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/directions_production/flatten_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/directions_production/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/directions_production/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/directions_production/batch_normalization_11/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/directions_production/batch_normalization_11/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/directions_production/output_0/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "8"}]}}}}}, {"name": "StatefulPartitionedCall/directions_production/output_0/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}}}, {"name": "input_layer", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/directions_production/conv2d_5/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/directions_production/conv2d_9/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}}, {"name": "StatefulPartitionedCall/directions_production/conv2d_5/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/directions_production/conv2d_6/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/directions_production/conv2d_6/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/directions_production/conv2d_7/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/directions_production/conv2d_7/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/directions_production/conv2d_8/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/directions_production/conv2d_8/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/directions_production/conv2d_9/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "96"}]}}}}}, {"name": "StatefulPartitionedCall/directions_production/re_lu_5/Relu", "op": "_FusedConv2D", "input": ["input_layer", "StatefulPartitionedCall/directions_production/conv2d_5/Conv2D_weights", "StatefulPartitionedCall/directions_production/conv2d_5/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "-5"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "32"}]}]}}, "num_host_args": {"i": "0"}, "num_args": {"i": "1"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "filter_format": {"s": "SFdJTw=="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/directions_production/re_lu_6/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/directions_production/re_lu_5/Relu", "StatefulPartitionedCall/directions_production/conv2d_6/Conv2D_weights", "StatefulPartitionedCall/directions_production/conv2d_6/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-6"}, {"size": "-7"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}]}}, "num_host_args": {"i": "0"}, "num_args": {"i": "1"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "filter_format": {"s": "SFdJTw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/directions_production/max_pooling2d_2/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/directions_production/re_lu_6/Relu"], "attr": {"data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/directions_production/re_lu_7/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/directions_production/max_pooling2d_2/MaxPool", "StatefulPartitionedCall/directions_production/conv2d_7/Conv2D_weights", "StatefulPartitionedCall/directions_production/conv2d_7/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-10"}, {"size": "-11"}, {"size": "32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}]}}, "num_host_args": {"i": "0"}, "num_args": {"i": "1"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "filter_format": {"s": "SFdJTw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/directions_production/re_lu_8/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/directions_production/re_lu_7/Relu", "StatefulPartitionedCall/directions_production/conv2d_8/Conv2D_weights", "StatefulPartitionedCall/directions_production/conv2d_8/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-12"}, {"size": "-13"}, {"size": "64"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}]}}, "num_host_args": {"i": "0"}, "num_args": {"i": "1"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "filter_format": {"s": "SFdJTw=="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "leakyrelu_alpha": {"f": 0.2}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/directions_production/max_pooling2d_3/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/directions_production/re_lu_8/Relu"], "attr": {"data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/directions_production/re_lu_9/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/directions_production/max_pooling2d_3/MaxPool", "StatefulPartitionedCall/directions_production/conv2d_9/Conv2D_weights", "StatefulPartitionedCall/directions_production/conv2d_9/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-16"}, {"size": "-17"}, {"size": "64"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "96"}]}]}}, "num_host_args": {"i": "0"}, "num_args": {"i": "1"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "filter_format": {"s": "SFdJTw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/directions_production/flatten_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/directions_production/re_lu_9/Relu", "StatefulPartitionedCall/directions_production/flatten_1/Const"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/directions_production/dense_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/directions_production/flatten_1/Reshape", "StatefulPartitionedCall/directions_production/dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/directions_production/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-20"}, {"size": "384"}]}, {"dim": [{"size": "384"}, {"size": "128"}]}]}}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/directions_production/batch_normalization_11/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/directions_production/dense_1/Relu", "StatefulPartitionedCall/directions_production/batch_normalization_11/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/directions_production/batch_normalization_11/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/directions_production/batch_normalization_11/batchnorm/mul_1", "StatefulPartitionedCall/directions_production/batch_normalization_11/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/directions_production/output_0/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/directions_production/batch_normalization_11/batchnorm/add_1", "StatefulPartitionedCall/directions_production/output_0/MatMul/ReadVariableOp", "StatefulPartitionedCall/directions_production/output_0/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-20"}, {"size": "128"}]}, {"dim": [{"size": "128"}, {"size": "8"}]}]}}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/directions_production/output_0/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/directions_production/output_0/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/directions_production/output_0/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 2288}}, "userDefinedMetadata": {"structuredOutputKeys": ["output_0"]}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/directions_production/flatten_1/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/directions_production/dense_1/MatMul/ReadVariableOp", "shape": [384, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/directions_production/dense_1/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/directions_production/batch_normalization_11/batchnorm/mul", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/directions_production/batch_normalization_11/batchnorm/sub", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/directions_production/output_0/MatMul/ReadVariableOp", "shape": [128, 8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/directions_production/output_0/BiasAdd/ReadVariableOp", "shape": [8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/directions_production/conv2d_5/Conv2D_weights", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/directions_production/conv2d_9/Conv2D_bn_offset", "shape": [96], "dtype": "float32"}, {"name": "StatefulPartitionedCall/directions_production/conv2d_5/Conv2D_bn_offset", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/directions_production/conv2d_6/Conv2D_weights", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/directions_production/conv2d_6/Conv2D_bn_offset", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/directions_production/conv2d_7/Conv2D_weights", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/directions_production/conv2d_7/Conv2D_bn_offset", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/directions_production/conv2d_8/Conv2D_weights", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/directions_production/conv2d_8/Conv2D_bn_offset", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/directions_production/conv2d_9/Conv2D_weights", "shape": [3, 3, 64, 96], "dtype": "float32"}]}]}